python/jinja2_macro.html
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgheadline1">1. 简介</a></li>
<li><a href="#orgheadline2">2. 用法</a></li>
<li><a href="#orgheadline3">3. 参数和变量</a></li>
<li><a href="#orgheadline6">4. 注意事项</a>
<ul>
<li><a href="#orgheadline4">4.1. macro的变量只能为如下三种:</a></li>
<li><a href="#orgheadline5">4.2. 和block的关系:</a></li>
</ul>
</li>
<li><a href="#orgheadline7">5. 参考文档</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1"><span class="section-number-2">1</span> 简介</h2>
<div class="outline-text-2" id="text-1">
<p>
jinja2是python的模板引擎, 在写python web使用的过程中,发现macro可以节省大量的代码.所以做了一个小的总结.
</p>

<p>
用法基本上都是网上的文章. 自己主要是写了注意事项,也算是心得体会.
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2"><span class="section-number-2">2</span> 用法</h2>
<div class="outline-text-2" id="text-2">
<p>
宏类似常规编程语言中的函数。它们用于把常用行为作为可重用的函数，取代 手动重复的工作。
例子:
</p>
<pre class="example">
{% macro input(name, value='', type='text', size=20) -%}
    &lt;input type="{{ type }}" name="{{ name }}" value="{{
        value|e }}" size="{{ size }}"&gt;
{%- endmacro %}
</pre>

<p>
在命名空间中，宏之后可以像函数一样调用:
</p>

<pre class="example">
&lt;p&gt;{{ input('username') }}&lt;/p&gt;
&lt;p&gt;{{ input('password', type='password') }}&lt;/p&gt;
</pre>
<p>
如果宏在不同的模板中定义，你需要首先使用 <b>import</b>
</p>
<pre class="example">
{% from 'base/macro/submit.macro' import test %}
</pre>
</div>
</div>

<div id="outline-container-orgheadline3" class="outline-2">
<h2 id="orgheadline3"><span class="section-number-2">3</span> 参数和变量</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
varargs
如果有多于宏接受的参数个数的位置参数被传入，它们会作为列表的值保存在 varargs 变量上。
kwargs
同 varargs ，但只针对关键字参数。所有未使用的关键字参数会存储在 这个特殊变量中。
caller
如果宏通过 call 标签调用，调用者会作为可调用的宏被存储在这个 变量中。
宏也可以暴露某些内部细节。下面的宏对象属性是可用的:

name
宏的名称。 {{ input.name }} 会打印 input 。
arguments
一个宏接受的参数名的元组。
defaults
默认值的元组。
catch_kwargs
如果宏接受额外的关键字参数（也就是访问特殊的 kwargs 变量），为 true 。
catch_varargs
如果宏接受额外的位置参数（也就是访问特殊的 varargs 变量），为 true 。
caller
如果宏访问特殊的 caller 变量且由 call 标签调用，为 true 。
</pre>
</div>
</div>


<div id="outline-container-orgheadline6" class="outline-2">
<h2 id="orgheadline6"><span class="section-number-2">4</span> 注意事项</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-orgheadline4" class="outline-3">
<h3 id="orgheadline4"><span class="section-number-3">4.1</span> macro的变量只能为如下三种:</h3>
<div class="outline-text-3" id="text-4-1">
<ol class="org-ol">
<li>参数变量</li>
<li>module变量</li>
<li>call 的变量</li>
</ol>

<p>
这个和其他的语言比如c语言的macro是很大的不同. 你在模块中想让macro引用自身的变量是不能实现的.
</p>
</div>
</div>

<div id="outline-container-orgheadline5" class="outline-3">
<h3 id="orgheadline5"><span class="section-number-3">4.2</span> 和block的关系:</h3>
<div class="outline-text-3" id="text-4-2">
<p>
macro的出现,本质是想解决重复代码的问题. 和block相比,因为不能使用module中的参数,也就是说和block是
相辅相成的关系. 不存在互相覆盖的问题.
</p>

<p>
<b>macro</b> 的重心在于替换简单的重复性质的代码. 
</p>

<p>
<b>block</b> 的重心在于重复框架代码的替换.
</p>
</div>
</div>
</div>

<div id="outline-container-orgheadline7" class="outline-2">
<h2 id="orgheadline7"><span class="section-number-2">5</span> 参考文档</h2>
<div class="outline-text-2" id="text-5">
<p>
<a href="http://docs.jinkan.org/docs/jinja2/templates.html#id19">模板设计者文档</a>
</p>
</div>
</div>
